package ktsyvis.lesson2;
/* Напишите программу, которая выводит хеллоу ворд
 */

public class L2task1 {
    public static void main(String[] args) {
        System.out.println("Hello Quarantine");
    }
}