package ktsyvis;
/*
Напишите тело main программы, которая выводит на экран 5 строк Я начинаю изучать Java
 */

public class L2task2 {
    public static void main(String[] args) {
        System.out.println("Я начинаю изучать Java \n" +
                "Я начинаю изучать Java\n" +
                "Я начинаю изучать Java\n" +
                "Я начинаю изучать Java\n" +
                "Я начинаю изучать Java");
    }
}

